var cards = 
    [{1:'2 Пик'}, {2:'3 Пик'}, {3:'4 Пик'}, {4:'5 Пик'}, {5:'6 Пик'}, {6:'7 Пик'}, {7:'8 Пик'}, {8:'9 Пик'}, {9:'10 Пик'}, {10:'В Пик'},
    {11:'Д Пик'}, {12:'К Пик'}, {13:'Т Пик'},
    {14:'2 Черви'}, {15:'3 Черви'}, {16:'4 Черви'}, {17:'5 Черви'}, {18:'6 Черви'}, {19:'7 Черви'}, {20:'8 Черви'}, {21:'9 Черви'}, {22:'10 Черви'}, {23:'В Черви'},
    {24:'Д Черви'}, {25:'К Черви'}, {26:'Т Черви'},
    {27:'2 Бубен'}, {28:'3 Бубен'}, {29:'4 Бубен'}, {30:'5 Бубен'}, {31:'6 Бубен'}, {32:'7 Бубен'}, {33:'8 Бубен'}, {34:'9 Бубен'}, {35:'10 Бубен'}, {36:'В Бубен'},
    {37:'Д Бубен'}, {38:'К ПиБубенк'}, {39:'Т Бубен'},
    {40:'2 Треф'}, {41:'3 Треф'}, {42:'4 Треф'}, {43:'5 Треф'}, {44:'6 Треф'}, {45:'7 Треф'}, {46:'8 Треф'}, {47:'9 Треф'}, {48:'10 Треф'}, {49:'В Треф'},
    {50:'Д Треф'}, {51:'К Треф'}, {52:'Т Треф'}];

var getCard = function () {
    card = Math.floor(Math.random()*cards.length+1);
    if( card%13 === 0 || card%13 === 11 || card%13 === 12) {
        return 10;
    }
    else if ( card%13 === 1) {
        return 11;
    }
    else {
        return card%13;
    }
    return card;
}

var card1 = getCard();
var card2 = getCard();
cards.splice(card1, 1);
cards.splice(card2, 1);
console.log(card1);
console.log(card2);

var score = function () {
    return card1+card2;
}

console.log("У вас " + cards[card1] + " и " + cards[card2] + ". Количество очков: " + score());

var result = function () {
    if ( score() > 21) {
        console.log("Вы проиграли");
    } 
    else {
        console.log("Вы выиграли")
    }
}
console.log(result());
